app/views/tasks/_form.html.haml

SELECT "users".* FROM "users"
---
    = f.input :description
    = f.input :owner_id, collection: (User.all.map { |s| [s.first_name, s.id]}), :include_blank => true