app/views/users/show.html.haml

			%tbody
				- project.tasks.select {|t| t.owner_id == @user.id}.each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (2, 1)