app/views/projects/show.html.haml

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 2]]
---
/ 		%tbody
/ 			- @project.tasks.each do |task|

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
/ 				%td= task.description
/ 				%td= link_to User.find(task.owner_id).first_name, user_path(task.owner_id)