app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @projects = Project.where.not(aasm_state: :complete)

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 2]]
---
  def show
    @tasks = @project.tasks
    @users = @project.users.includes(:tasks)

INSERT INTO "projects" ("name", "client", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Our first project!"], ["client", "BNB"], ["created_at", "2017-02-20 18:05:35.257665"], ["updated_at", "2017-02-20 18:05:35.257665"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save