app/controllers/tasks_controller.rb

  def create
    @task = @project.tasks.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("description", "due_at", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "My first task"], ["due_at", "2017-02-22 19:25:00.000000"], ["created_at", "2017-02-22 19:26:03.258222"], ["updated_at", "2017-02-22 19:26:03.258222"]]

  def update_state
    if @task.incomplete?
      @task.mark_complete!
      @task.update(completed_at: Time.now)
---
UPDATE "tasks" SET "aasm_state" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["aasm_state", "complete"], ["updated_at", "2017-03-13 16:16:23.267564"], ["id", 4]]