app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 3]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" IN (2, 1)
---
	def show
		@user = User.find(params[:id])
		@projects = @user.projects.includes(:tasks).where.not(aasm_state: :complete)